// lib/shippingData.js

export const shippingDatabase = [
  // --- กรุงเทพมหานคร ---
  { "รหัส": "10100", "ตำบล": "คลองมหานาค", "อำเภอ": "ป้อมปราบศัตรูพ่าย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "บ้านบาตร", "อำเภอ": "ป้อมปราบศัตรูพ่าย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "ป้อมปราบ", "อำเภอ": "ป้อมปราบศัตรูพ่าย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "วัดเทพศิรินทร์", "อำเภอ": "ป้อมปราบศัตรูพ่าย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "วัดโสมนัส", "อำเภอ": "ป้อมปราบศัตรูพ่าย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "จักรวรรดิ์", "อำเภอ": "สัมพันธวงศ์", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "ตลาดน้อย", "อำเภอ": "สัมพันธวงศ์", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10100", "ตำบล": "สัมพันธวงศ์", "อำเภอ": "สัมพันธวงศ์", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10110", "ตำบล": "คลองตัน", "อำเภอ": "คลองเตย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10110", "ตำบล": "คลองเตย", "อำเภอ": "คลองเตย", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 600 },
  { "รหัส": "10110", "ตำบล": "วังใหม่", "อำเภอ": "ปทุมวัน", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 500 },
  { "รหัส": "10530", "ตำบล": "หนองจอก", "อำเภอ": "หนองจอก", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 1700 },
  { "รหัส": "10600", "ตำบล": "คลองสาน", "อำเภอ": "คลองสาน", "จังหวัด": "กรุงเทพมหานคร", "ค่ารถ": 400 },

  // --- สมุทรสาคร ---
  { "รหัส": "74110", "ตำบล": "คลองมะเดื่อ", "อำเภอ": "กระทุ่มแบน", "จังหวัด": "สมุทรสาคร", "ค่ารถ": 400 },
  { "รหัส": "74110", "ตำบล": "แคราย", "อำเภอ": "กระทุ่มแบน", "จังหวัด": "สมุทรสาคร", "ค่ารถ": 400 },
  { "รหัส": "74120", "ตำบล": "บ้านแพ้ว", "อำเภอ": "บ้านแพ้ว", "จังหวัด": "สมุทรสาคร", "ค่ารถ": 1200 },
  { "รหัส": "74000", "ตำบล": "โคกขาม", "อำเภอ": "เมืองสมุทรสาคร", "จังหวัด": "สมุทรสาคร", "ค่ารถ": 400 },

  // --- สมุทรปราการ ---
  { "รหัส": "10130", "ตำบล": "ตลาด", "อำเภอ": "พระประแดง", "จังหวัด": "สมุทรปราการ", "ค่ารถ": 500 },
  { "รหัส": "10270", "ตำบล": "สำโรงเหนือ", "อำเภอ": "เมืองสมุทรปราการ", "จังหวัด": "สมุทรปราการ", "ค่ารถ": 600 },
  { "รหัส": "10290", "ตำบล": "นาเกลือ", "อำเภอ": "พระสมุทรเจดีย์", "จังหวัด": "สมุทรปราการ", "ค่ารถ": 500 },

  // --- นนทบุรี ---
  { "รหัส": "11000", "ตำบล": "ตลาดขวัญ", "อำเภอ": "เมืองนนทบุรี", "จังหวัด": "นนทบุรี", "ค่ารถ": 400 },
  { "รหัส": "11110", "ตำบล": "บางบัวทอง", "อำเภอ": "บางบัวทอง", "จังหวัด": "นนทบุรี", "ค่ารถ": 600 },
  { "รหัส": "11120", "ตำบล": "ปากเกร็ด", "อำเภอ": "ปากเกร็ด", "จังหวัด": "นนทบุรี", "ค่ารถ": 500 },

  // --- ปทุมธานี ---
  { "รหัส": "12000", "ตำบล": "บางกะดี", "อำเภอ": "เมืองปทุมธานี", "จังหวัด": "ปทุมธานี", "ค่ารถ": 1000 },
  { "รหัส": "12120", "ตำบล": "คลองสอง", "อำเภอ": "คลองหลวง", "จังหวัด": "ปทุมธานี", "ค่ารถ": 1500 },
  { "รหัส": "12140", "ตำบล": "ลาดหลุมแก้ว", "อำเภอ": "ลาดหลุมแก้ว", "จังหวัด": "ปทุมธานี", "ค่ารถ": 1000 }
];